[
  {
    "name": "Richard Feldman",
    "talk_title": "NEED",
    "talk_subtitle": "",
    "talk_abstract": "NEED",
    "bio": "NEED",
    "headshot": "images/speakers/richard.jpg"
  },
  {
    "name": "Andrew MacMurray",
    "talk_title": "Building Seeds",
    "talk_subtitle": "A Smartphone Game for the Browser",
    "talk_abstract": "Three years ago I got inspired to build a game for the browser. Since then it’s lived and died as a React app and re-emerged as an Elm app. My talk is an experience report on this journey - pain points, surprises, the joys of using Elm and a whole lot of learning!",
    "bio": "I'm a software crafter working at 8th Light. I've developed a deep love for functional programming and types, it's like writing music and playing Tetris at the same time! Other loves include video games, Rupaul's Drag Race and minimalism.",
    "headshot": "images/speakers/andrew.jpg"
  },
  {
    "name": "Brian Hicks",
    "talk_title": "Robot Buttons From Mars",
    "talk_subtitle": "",
    "talk_abstract": "NEED",
    "bio": "Brian Hicks is the lead organizer of elm-conf and the author of Mastering Elm: JSON Decoders and elm-particle. He lives in St. Louis with his wife, son, and cat.",
    "headshot": "images/speakers/brian.jpg"
  },
  {
    "name": "Dan Abrams",
    "talk_title": "Screenplay by Elm",
    "talk_subtitle": "Writing a Specialized WYSIWYG Editor Using Elm-UI and elm/parser",
    "talk_abstract": "Working with HTML in Elm is a joy: creating little reusable functions like button is so fun! But what happens when options invade? Icons? Sizes? Loading states? In this talk, we introduce options for dealing with the inevitable complexity in your style guide and get back to the joy of creation.",
    "bio": "",
    "headshot": "images/speakers/dan.jpg"
  },
  {
    "name": "Emma",
    "talk_title": "NEED",
    "talk_subtitle": "",
    "talk_abstract": "NEED",
    "bio": "NEED",
    "headshot": "images/speakers/you.jpg"
  },
  {
    "name": "Joël Quenneville",
    "talk_title": "A Number by Any Other Name",
    "talk_subtitle": "",
    "talk_abstract": "In 1999 NASA’s Mars probe infamously crashed due to a unit of measure error. 20 years later we still write the same bug. Join me as we leverage Elm’s type system to catch these, get better errors, and improve readability. Along the way we’ll challenge some common assumptions we have around numbers.",
    "bio": "Joël is a software developer at thoughtbot. He's fallen in love with Elm's data modeling tools. Over the past year he's discovered the fun of game jams and built three games in Elm. Outside of programming you can find him buried in a history book or exploring the many neighborhoods of Boston. You can spot him at the conference as that guy with the cool hat. Come say hi!",
    "headshot": "images/speakers/joel.jpg"
  },
  {
    "name": "Nikhil Sharma",
    "talk_title": "Exploring Elm's Compiler Error Messages",
    "talk_subtitle": "",
    "talk_abstract": "Everyone knows that Elm has great error messages, but do you know all of the kinds of error messages you can get?\nIn this talk, we will: 1. Categorize all of Elm’s error messages. 2. Learn how to produce some of the more obscure errors. 3. Learn how to get the most out of your error messages.",
    "bio": "NEED",
    "headshot": "images/speakers/nik.jpg"
  },
  {
    "name": "Noah Zachary Gordon",
    "talk_title": "Conventions for Message Naming",
    "talk_subtitle": "",
    "talk_abstract": "Messages are a fundamental piece of the Elm Architecture, defining exactly how the world can interact with your program. But often we choose message names without precision. In this talk I will outline a set of message naming conventions that can make your code more flexible and resilient to change.",
    "bio": "Noah is a technologist from Brooklyn, NY who likes his Elm with a soft-boiled egg and black coffee. He organizes the Elm NYC meetup group and is a Recurse Center alumnus. Prolonged exposure to Noah is not recommended. Consult your primary care physician before seeking Noah.",
    "headshot": "images/speakers/noah.jpg"
  },
  {
    "name": "Yonatan Kogan",
    "talk_title": "Put Your Model in the Cloud",
    "talk_subtitle": "Sharing One Elm Model Across Multiple Clients",
    "talk_abstract": "Shared workspace applications need an agreed on view of the world that multiple clients can see and update simultaneously. In this talk we show how we used the Elm architecture in production to share a read/writable Elm model across multiple clients, with minimal server involvement.",
    "bio": "NEED",
    "headshot": "images/speakers/yonatan.jpg"
  },
  {
    "name": "Katie (?)",
    "talk_title": "NEED",
    "talk_subtitle": "",
    "talk_abstract": "NEED",
    "bio": "NEED",
    "headshot": "images/speakers/you.jpg"
  },
  {
    "name": "Kofi Gumbs",
    "talk_title": "Guaranteed Refactors",
    "talk_subtitle": "Generating Tests from Types",
    "talk_abstract": "Many of us are familiar with the situation: you want to refactor some code, but it has no tests! Elm gives us confidence that the types fit, but how can I be sure I haven’t changed or broken behavior? In this talk you’ll learn about a testing workflow that uses types to guarantee refactors.",
    "bio": "Kofi lives in Chicago and writes software, both professionally and for fun. By day, he works at HubTran, using test-driven development wherever he can. By night, he theorizes how to make those tests unnecessary — using declarative systems with strong guarantees.",
    "headshot": "images/speakers/kofi.jpg",
    "social": [
      {
        "network": "website",
        "src": "https://kofi.sexy"
      },
      {
        "network": "twitter",
        "src": "https://twitter.com/@hkgumbs"
      }
    ]
  }
]
